conf_files/Reports/АнализСессий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>АнализСессий</Name>
		</Properties>
	</Report>
</MetaDataObject>

conf_files/InformationRegisters/СеансыПользователейИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>СеансыПользователейИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приложения1С</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

conf_files/Reports/АнализСессий/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	
	идНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("ПериодичностьЗамера")).идентификаторПользовательскойНастройки;
	периодичностьЗамера = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(идНастройки).Значение;
	
	идНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("Период")).идентификаторПользовательскойНастройки;
	период = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(идНастройки).Значение;

	таблицаИсточник = ИнициализироватьТаблицуИсточникНабораДанных(период, ПериодичностьЗамера);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);

	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ИсточникНабораДанных",таблицаИсточник);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	      
КонецПроцедуры

Функция ИнициализироватьТаблицуИсточникНабораДанных(период, периодичностьЗамера)
	
	табВремени = новый таблицаЗначений;
	мТипов = новый массив;
	
	квалификатор = новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	мТипов.Добавить(тип("Дата"));
	описаниеТипов = новый ОписаниеТипов(мТипов, , , квалификатор);
	табВремени.Колонки.Добавить("Дата", описаниеТипов);

	моментЗамера = период.ДатаНачала;
	
	пока моментЗамера <= Период.ДатаОкончания цикл		
		стрТаблицыВремени = табВремени.Добавить();
		стрТаблицыВремени.Дата = моментЗамера;
		моментЗамера = моментЗамера + ПериодичностьЗамера*60;		
	КонецЦикла;
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаВремени.Дата КАК Дата
	               |ПОМЕСТИТЬ втВремени
	               |ИЗ
	               |	&ТаблицаВремени КАК ТаблицаВремени
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втВремени.Дата КАК Момент,
	               |	СеансыПользователейИнформационныхБаз.Дата КАК Дата,
	               |	СеансыПользователейИнформационныхБаз.Сервер КАК Сервер,
	               |	СеансыПользователейИнформационныхБаз.ИнформационнаяБаза КАК ИнформационнаяБаза,
	               |	СеансыПользователейИнформационныхБаз.ИмяПользователя КАК ИмяПользователя,
	               |	СеансыПользователейИнформационныхБаз.Приложение1С КАК Приложение1С,
	               |	СеансыПользователейИнформационныхБаз.НачалоСеанса КАК НачалоСеанса,
	               |	СеансыПользователейИнформационныхБаз.КонецСеанса КАК КонецСеанса,
	               |	СеансыПользователейИнформационныхБаз.НомерСессии КАК НомерСессии,
	               |	СеансыПользователейИнформационныхБаз.ИнформационнаяБаза.Партнер КАК Партнер
	               |ИЗ
	               |	втВремени КАК втВремени
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СеансыПользователейИнформационныхБаз КАК СеансыПользователейИнформационныхБаз
	               |		ПО втВремени.Дата >= СеансыПользователейИнформационныхБаз.НачалоСеанса
	               |			И втВремени.Дата <= СеансыПользователейИнформационныхБаз.КонецСеанса";
	запрос.УстановитьПараметр("ТаблицаВремени", табВремени);
	
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции
